# **SpaceX Falcon9 launch prediction project** 
### **<span style="color:#ff9933">Part 2: Exploratory Analysis</span>** 
**Mason Phung**   
Last edited: December 2024

*Space Exploration Technologies Corp. or SpaceX is an American spacecraft manufacturer, popular for their successful mission in sending a spacecraft and astronauts to the International Space Station. They are also well-known for their [VTVL](https://en.wikipedia.org/wiki/VTVL) rocket launches , in which rockets can land and be resued, thus save a huge amount of launching cost for the company.*

*One of SpaceX's most popular rocket - the Falcon 9, have landed and reflown [more than 200 times](https://en.wikipedia.org/wiki/List_of_Falcon_9_and_Falcon_Heavy_launches) . The rocket was advertised on its website with a launch cost of 62 million dollars; other providers cost upward of 165 million dollars each, much of the savings is because SpaceX can reuse the first stage. Therefore if we can determine if the first stage will land, we can determine the cost of a launch.*

*We are working at a business in the aerospace industry who are developing a space rocket and are researching different rocket technologies and their competitiors.*

*In this project, we will collect & analyze past launches data of the Falcon 9 rockets then try to predict the outcome of future launches using different Machine Learning models. The main purpose is to find which factor contributes to the success of each flight and to build a Machine Learning model that can predict the outcome of a rocket launch.*

**Questions**
1. What are the important features that contributes to the success of each launch?
2. Does geography play an essential role in the success of each launch?
3. What can be suggested to improve to increase the successful rate?
4. What can be suggested to improve the reliability of the predicting model?

# **<span style="color:#ff9933">Process description</span>**

**Part 1: Data collection by requesting API and web scrapping**
- Request data from SpaceX API using `requests` and webscrape from wikipedia using `BeautifulSoup`
- Clean & format data after collecting

<span style="color:#ff9933">

**Part 2: Descriptive analysis using:**
- Make Python & SQL queries to explore the datasets
- Setting up a local SQL database(server)

</span>

**Part 3: Visualization:**
- Plotting with `matplotlib` and `seaborn`   
- Geographical visualization with `folium`   
- Build an Interactive dashboard with `dash` and `plotly.express` (in a separate dash app)

**Part 4: Machine Learning with `sklearn` (Classification):**
- Apply different techniques to enhance models' accuracy & correctness including:
    - Select features based on correlation strength + multicollinearity
    - Features engineering: convert categorical non-numerical data into numerical format
    - Train/test split with stratification to ensure data balance
    - Normalize data to ensure the variables have a standard scale
- Models: Logistic Regression, Support Vector Machine, Decision Trees, K nearest neighbors, XGBoost, Neural Networks
- After applying default models, conduct hyperparamter tuning with `GridSearchCV` to improve the models' performances

**Part 5: Discussion**
- Notable observations gained when anaylyze data
- The performance of the Machine Learning (ML) models
- The cons of the project and the dataset
- Improvements & suggestion

----

# **<span style="color:#ff9933">Libraries</span>**

In [ ]:
# Basics & cores for our work + data manipulation
import pandas as pd

# Suppress warnings
import warnings
warnings.filterwarnings("ignore")

# Print all collumns of a dataframe
pd.set_option('display.max_columns', None)
# Print all of the data in a feature
pd.set_option('display.max_colwidth', None)

In [ ]:
# utils
import sys
from pathlib import Path

# Add the src directory to the system path
for i in ["src", "dataset"]:
    i_path = Path(f"../{i}").resolve()
    if str(i_path) not in sys.path:
        sys.path.append(str(i_path))

from src import mysql_init

In [ ]:
# Import data
falcon9_general=pd.read_csv("dataset/Falcon9_general.csv")
falcon9_technical=pd.read_csv("dataset/Falcon9_technical.csv")

# **<span style="color:#ff9933">Part 2: Exploratory Analysis**</span>

## **A. Descriptive Analysis with Python**

### <span style="color:#ff9933">I. Sites and rocket launches</span>

The data included the name of several Space X launch facilities: 
- <a href='https://en.wikipedia.org/wiki/List_of_Cape_Canaveral_and_Merritt_Island_launch_sites'>Cape Canaveral Space</a> Launch Complex 40  <b>CCAFS SLC 40 </b>
- Vandenberg Air Force Base Space Launch Complex 4E <b>(VAFB SLC 4E)</b>
- Kennedy Space Center Launch Complex 39A <b>KSC LC 39A </b>

**Determine the number of launches  on each site:**

In [39]:
# Apply value_counts() on column LaunchSite
falcon9_technical['LaunchSite'].value_counts()

LaunchSite
CCSFS SLC 40    55
KSC LC 39A      22
VAFB SLC 4E     13
Name: count, dtype: int64

<span style="color:#ff9933">*Site CCAFS SLC 40 has the most number of launches with 55 times.*</span>

**Find the success rate of each site**

In [40]:
falcon9_technical.groupby('LaunchSite')['Class'].mean().round(3)

LaunchSite
CCSFS SLC 40    0.600
KSC LC 39A      0.773
VAFB SLC 4E     0.769
Name: Class, dtype: float64

<span style="color:#ff9933">*KSC LC 39A has the highest success rate while CCSFS has the lowest.*</span>

### <span style="color:#ff9933">II. Find the number and occurrence of each orbit</span>

Each launch aims to an dedicated orbit, and here are some common orbit types:



* <b>LEO</b>: Low Earth orbit (LEO)is an Earth-centred orbit with an altitude of 2,000 km (1,200 mi) or less (approximately one-third of the radius of Earth),[1] or with at least 11.25 periods per day (an orbital period of 128 minutes or less) and an eccentricity less than 0.25.[2] Most of the manmade objects in outer space are in LEO <a href='https://en.wikipedia.org/wiki/Low_Earth_orbit'>[1]</a>.

* <b>VLEO</b>: Very Low Earth Orbits (VLEO) can be defined as the orbits with a mean altitude below 450 km. Operating in these orbits can provide a number of benefits to Earth observation spacecraft as the spacecraft operates closer to the observation<a href='https://www.researchgate.net/publication/271499606_Very_Low_Earth_Orbit_mission_concepts_for_Earth_Observation_Benefits_and_challenges'>[2]</a>.


* <b>GTO</b> A geosynchronous orbit is a high Earth orbit that allows satellites to match Earth's rotation. Located at 22,236 miles (35,786 kilometers) above Earth's equator, this position is a valuable spot for monitoring weather, communications and surveillance. Because the satellite orbits at the same speed that the Earth is turning, the satellite seems to stay in place over a single longitude, though it may drift north to south,” NASA wrote on its Earth Observatory website <a  href="https://www.space.com/29222-geosynchronous-orbit.html" >[3] </a>.


* <b>SSO (or SO)</b>: It is a Sun-synchronous orbit  also called a heliosynchronous orbit is a nearly polar orbit around a planet, in which the satellite passes over any given point of the planet's surface at the same local mean solar time <a href="https://en.wikipedia.org/wiki/Sun-synchronous_orbit">[4] <a>.
    
    
    
* <b>ES-L1 </b>:At the Lagrange points the gravitational forces of the two large bodies cancel out in such a way that a small object placed in orbit there is in equilibrium relative to the center of mass of the large bodies. L1 is one such point between the sun and the earth <a href="https://en.wikipedia.org/wiki/Lagrange_point#L1_point">[5]</a> .
    
    
* <b>HEO</b> A highly elliptical orbit, is an elliptic orbit with high eccentricity, usually referring to one around Earth <a href="https://en.wikipedia.org/wiki/Highly_elliptical_orbit">[6]</a>.


* <b> ISS </b> A modular space station (habitable artificial satellite) in low Earth orbit. It is a multinational collaborative project between five participating space agencies: NASA (United States), Roscosmos (Russia), JAXA (Japan), ESA (Europe), and CSA (Canada)<a href="https://en.wikipedia.org/wiki/International_Space_Station"> [7] </a>


* <b> MEO </b> Geocentric orbits ranging in altitude from 2,000 km (1,200 mi) to just below geosynchronous orbit at 35,786 kilometers (22,236 mi). Also known as an intermediate circular orbit. These are "most commonly at 20,200 kilometers (12,600 mi), or 20,650 kilometers (12,830 mi), with an orbital period of 12 hours <a href="https://en.wikipedia.org/wiki/List_of_orbits"> [8] </a>


* <b> HEO </b> Geocentric orbits above the altitude of geosynchronous orbit (35,786 km or 22,236 mi) <a href="https://en.wikipedia.org/wiki/List_of_orbits"> [9] </a>


* <b> GEO </b> It is a circular geosynchronous orbit 35,786 kilometres (22,236 miles) above Earth's equator and following the direction of Earth's rotation <a href="https://en.wikipedia.org/wiki/Geostationary_orbit"> [10] </a>


* <b> PO </b> It is one type of satellites in which a satellite passes above or nearly above both poles of the body being orbited (usually a planet such as the Earth <a href="https://en.wikipedia.org/wiki/Polar_orbit"> [11] </a>

some are shown in the following plot:

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DS0701EN-SkillsNetwork/api/Images/Orbits.png)

**Determine the number and occurrence of each orbit in the  column <code>Orbit</code>**

In [41]:
falcon9_technical['Orbit'].value_counts()

Orbit
GTO      27
ISS      21
VLEO     14
PO        9
LEO       7
SSO       5
MEO       3
ES-L1     1
HEO       1
SO        1
GEO       1
Name: count, dtype: int64

<span style="color:#ff9933">*Orbit GTO and ISS were aimed at for most launches*</span>

### <span style="color:#ff9933">III. Analyze mission outcome result</span>

In [42]:
# Determine the number of landing outcomes
total = falcon9_technical.shape[0]
# Count of each outcome
landing_outcomes = pd.DataFrame(falcon9_technical['Outcome'].value_counts().reset_index(name = 'Count'))
# Percentage of each outcome
landing_outcomes['Percentage'] = round(100* (landing_outcomes['Count']/ total), 1)
landing_outcomes

       Outcome  Count  Percentage
0    True ASDS     41        45.6
1    None None     19        21.1
2    True RTLS     14        15.6
3   False ASDS      6         6.7
4   True Ocean      5         5.6
5  False Ocean      2         2.2
6    None ASDS      2         2.2
7   False RTLS      1         1.1

- <code>True Ocean</code>: the mission outcome was successfully  landed to a specific region of the ocean.
- <code>False Ocean</code>: the mission outcome was unsuccessfully landed to a specific region of the ocean. 
- <code>True RTLS</code>: the mission outcome was successfully landed to a ground pad.
- <code>False RTLS</code>: the mission outcome was unsuccessfully landed to a ground pad.
- <code>True ASDS</code>: the mission outcome was successfully  landed to a drone ship.
- <code>False ASDS</code>: the mission outcome was unsuccessfully landed to a drone ship. 
- <code>None ASDS</code> and <code>None None</code>: a failure to land.

- <span style="color:#ff9933">*ASDS (Land to a drone ship) dominates the mission list (49/90), with most of them are successful.*</span>
- <span style="color:#ff9933">*RTLS (Land to a ground pad) has significant high success rate of 93%*</span>
- <span style="color:#ff9933">*There is a considerable number of `failed to land` mission outcomes (23%)*</span>

**Determine the success rate**

In [43]:
print(
    'Success rate:', round(falcon9_technical["Class"].mean()*100,2),'%'
)

Success rate: 66.67 %

## **B. Descriptive Analysis with SQL**

Python's `sqlalchemy` package and `MySQL` will be used to do SQL queries. To start, load dataset and set up a connection between the Python environment and SQL database. Then, after importing the database to the local MySQL server, we will make queries with SQL `magic functions`.

###  <span style="color:#ff9933"> I. Setting up a local database</span>

- A local MySQL server was created in the background and an user information were predefined. 
- In this markdown, we'll just establish a connection between VSCode and the MySQL server.
- Set up the connection by using `SQLAlchemy` and `MySQL Connector`

Load SQL extension and establish a connection with the database

In [44]:
%load_ext sql
%sql mysql+mysqlconnector://root:tttn0711@localhost:3306/data 
# %sql mysql://username:password@host:port/database_name

Engine configuration (Required to use `sqlalchemy`) and Import the dataset to SQL database

In [ ]:
mysql_init.init(data=falcon9_general,username='root', password='tttn0711', host='localhost:3306/data')

### <span style="color:#ff9933">II. Querying</span>

#### 1. Display the names of the unique launch sites in the space mission

In [47]:
%%sql
SELECT distinct launch_site
FROM spacextbl

 * mysql+mysqlconnector://root:***@localhost:3306/data
3 rows affected.

[('CCSFS',), ('VAFB',), ('KSC',)]

*There are 3 launch sites, similar to what we have observed in the technical dataset*

#### 2. Display 5 records where launch sites begin with the string 'CCS'

In [48]:
%%sql
SELECT *
FROM spacextbl
WHERE launch_site LIKE 'CCS%'
LIMIT 5

 * mysql+mysqlconnector://root:***@localhost:3306/data
5 rows affected.

[('1', 'CCSFS', 'Dragon Spacecraft Qualification Unit', '0', 'LEO', 'SpaceX', 'Success ', 'F9 v1.0B0003.1', 'Failure', datetime.datetime(2010, 6, 4, 0, 0), '18:45'),
 ('2', 'CCSFS', 'Dragon', '0', 'LEO', 'NASA (COTS) NRO', 'Success', 'F9 v1.0B0004.1', 'Failure', datetime.datetime(2010, 12, 8, 0, 0), '15:43'),
 ('3', 'CCSFS', 'Dragon', '525', 'LEO', 'NASA (COTS)', 'Success', 'F9 v1.0B0005.1', 'No attempt ', datetime.datetime(2012, 5, 22, 0, 0), '07:44'),
 ('4', 'CCSFS', 'SpaceX CRS-1', '4700', 'LEO', 'NASA (CRS)', 'Success ', 'F9 v1.0B0006.1', 'No attempt', datetime.datetime(2012, 10, 8, 0, 0), '00:35'),
 ('5', 'CCSFS', 'SpaceX CRS-2', '4877', 'LEO', 'NASA (CRS)', 'Success ', 'F9 v1.0B0007.1', 'No attempt ', datetime.datetime(2013, 3, 1, 0, 0), '15:10')]

#### 3. Display the total payload mass carried by boosters launched by NASA (CRS)

In [49]:
%%sql 
SELECT customer, SUM(payload_mass) AS total_payload_mass
FROM spacextbl
WHERE Customer = 'NASA (CRS)'
GROUP BY Customer

 * mysql+mysqlconnector://root:***@localhost:3306/data
1 rows affected.

[('NASA (CRS)', 59941.0)]

#### 4. Display average `payload_mass` carried by `booster_version` F9 v1.1

In [50]:
%%sql 
SELECT booster_version, AVG(payload_mass) AS avg_payload_mass
FROM spacextbl
WHERE booster_version = 'F9 v1.1'
GROUP BY booster_version

 * mysql+mysqlconnector://root:***@localhost:3306/data
1 rows affected.

[('F9 v1.1', 2680.0)]

- <span style="color:#ff9933">*This still far away from the maximum payload mass observed in the dataset of 15600kg*</span>
- <span style="color:#ff9933">*On the other hand, this also shows how later version of Falcon9 booster improved its ability to carry heavy payload mass*</span>

#### 5. List the date when the first successful `landing_outcome` was achieved

In [51]:
%%sql
SELECT MIN(date), landing_outcome
FROM spacextbl
WHERE landing_outcome = 'Success'

 * mysql+mysqlconnector://root:***@localhost:3306/data
1 rows affected.

[(datetime.datetime(2015, 12, 22, 0, 0), 'Success')]

#### 6. List the names of the boosters which is success and have `payload_mass` greater than 4000 but less than 6000

In [52]:
%%sql
SELECT DISTINCT booster_version, landing_outcome
FROM spacextbl
WHERE landing_outcome = 'Success' AND (payload_mass BETWEEN 4000 AND 6000)

 * mysql+mysqlconnector://root:***@localhost:3306/data
12 rows affected.

[('F9 FT', 'Success'),
 ('F9 FT♺', 'Success'),
 ('F9 B4', 'Success'),
 ('F9 FTB1031.2', 'Success'),
 ('F9 B5B1046.2', 'Success'),
 ('F9 B5B1047.2', 'Success'),
 ('F9 B5B1046.3', 'Success'),
 ('F9 B5B1048.3', 'Success'),
 ('F9 B5B1051.2', 'Success'),
 ('F9 B5', 'Success'),
 ('F9 B5B1058.2', 'Success'),
 ('F9 B5B1058.5', 'Success')]

#### 7. List the total number of successful and failure `mission_outcome`

In [53]:
%%sql
SELECT TRIM(mission_outcome) as outcomes, COUNT(mission_outcome) as count
FROM spacextbl
GROUP BY outcomes

 * mysql+mysqlconnector://root:***@localhost:3306/data
2 rows affected.

[('Success', 117), ('Failure', 1)]

- *Applied `TRIM()` because `mission_outcome` values were misintepreted, there were duplicated outcomes of `Success`*

- *99% of the mission outcomes are successful (117/118)*

#### 8. List the names of the `booster_version` which have carried the maximum `payload_mass`

In [54]:
%%sql
SELECT DISTINCT booster_version, payload_mass
FROM spacextbl
WHERE payload_mass IN (
    SELECT MAX(payload_mass)
    FROM spacextbl
)

 * mysql+mysqlconnector://root:***@localhost:3306/data
6 rows affected.

[('F9 FT', '9600'),
 ('F9 B4', '9600'),
 ('F9 FTB1036.2', '9600'),
 ('F9 B4B1041.2', '9600'),
 ('F9 B5B1048', '9600'),
 ('F9 B5B1049.2', '9600')]

#### 9. List the records which will display the month names, failure `landing_outcomes` ,`booster_version`, `launch_site` for the months in year 2015

In [55]:
%%sql
SELECT YEAR(date) as Year, DATE_FORMAT(Date, '%M') AS Month, booster_version, launch_site, landing_outcome
FROM spacextbl
WHERE landing_outcome = 'Failure' AND YEAR(Date) = 2015

 * mysql+mysqlconnector://root:***@localhost:3306/data
1 rows affected.

[(2015, 'April', 'F9 v1.1', 'CCSFS', 'Failure')]

#### 10. Rank the count of `landing_outcome` (Failure or Success) between the date 2010-06-04 and 2017-03-20, in descending order.

<span style="color:#ff9933">If we use normal query, the result will look like this</span>

In [56]:
%%sql 
SELECT landing_outcome, COUNT(landing_outcome) AS count
FROM spacextbl
WHERE Date BETWEEN '2010-06-04' AND '2017-03-20'
GROUP BY landing_outcome
ORDER BY Count DESC

 * mysql+mysqlconnector://root:***@localhost:3306/data
8 rows affected.

[('Success', 8),
 ('No attempt', 7),
 ('Failure', 6),
 ('No attempt ', 3),
 ('Controlled', 3),
 ('Uncontrolled', 2),
 ('Failure ', 1),
 ('Precluded', 1)]

<span style="color:#ff9933">

- *`No attempt` and `Failure` appeared twice, this may be caused by any trailing or space in each observation*
- *To fix this, we'll use `TRIM()`, which help to remove any leading or trailing spaces from the `landing_outcome`.*

</span>

In [57]:
%%sql  
SELECT TRIM(UPPER(landing_outcome)) AS standardized_landing_outcome, COUNT(*) AS count
FROM spacextbl
WHERE Date BETWEEN '2010-06-04' AND '2017-03-20'
GROUP BY standardized_landing_outcome
ORDER BY COUNT(*) DESC

 * mysql+mysqlconnector://root:***@localhost:3306/data
6 rows affected.

[('NO ATTEMPT', 10),
 ('SUCCESS', 8),
 ('FAILURE', 7),
 ('CONTROLLED', 3),
 ('UNCONTROLLED', 2),
 ('PRECLUDED', 1)]

*'No attemp' landing outcome has the most number of count (10)*